# IsAutoDetectEnabled Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSketchComponent..::..IsAutoDetectEnabled Method
AnalyticalModelSketchComponent Class See Also
---
Indicates whether Auto-detect is enabled on the given Sketch component.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsAutoDetectEnabled()
```

Visual Basic
---
```text
Public Function IsAutoDetectEnabled As Boolean
```

Visual C++
---
```text
public:
bool IsAutoDetectEnabled()
```

# ### Return Value
True if Auto-detect is enabled, false otherwise.
# See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace